<a href="https://colab.research.google.com/github/wasp33/ximen0703/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from urllib.request import urlretrieve
url="https://github.com/Elwing-Chou/ximen0703/raw/main/titanic/test.csv"
urlretrieve(url,"test.csv")
url="https://github.com/Elwing-Chou/ximen0703/raw/main/titanic/train.csv"
urlretrieve(url,"train.csv")

('train.csv', <http.client.HTTPMessage at 0x7f91262de740>)

處理前先分類
1. 類別型 Pclass,Name(MID),Sex,Cabin,Embarked
2. 數值型 Age,Sibsp,Parch,ticket(count), Fare
類別最可能: 最常出現的值
數值最可能:

偏度定義; $ \frac{1}{n} \sum_{i=1}^n (P_i-avg)^3 $

GDP => 平均

薪資 => 中位數

成績 => 中位數

In [16]:
import pandas as pd
datas = pd.read_csv("train.csv", encoding="utf-8")
data_predict = pd.read_csv("test.csv",encoding="utf-8")
#data = pd.DataFrame(datas)

In [24]:
data_total=pd.concat([datas,data_predict],axis=0)
#data_total

data_total=data_total.drop(["PassengerId","Survived"], axis=1)
data_total

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
413,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [13]:
from sklearn.model_selection import train_test_split
x = data.drop("Survived", axis=1)
y = data["Survived"]
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.1)